{"modelTopology": {"model_config": {"config": {"layers": [{"config": {"batch_input_shape": [null, 28, 28], "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "name": "dense_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "units": 512, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_1", "noise_shape": null, "trainable": true, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "name": "dense_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}, "training_config": {"loss": "sparse_categorical_crossentropy", "weighted_metrics": null, "sample_weight_mode": null, "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "loss_weights": null, "metrics": ["accuracy"]}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}, "weightsManifest": [{"weights": [{"shape": [784, 512], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [512], "dtype": "float32", "name": "dense_2/bias"}, {"shape": [512, 10], "dtype": "float32", "name": "dense_3/kernel"}, {"shape": [10], "dtype": "float32", "name": "dense_3/bias"}], "paths": ["group1-shard1of1"]}]}